content.org
#+TITLE: CS 421 Web Content
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: lectures

** Prolog Cut
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :type book
:EXPORT_FILE_NAME: prolog-cut
:END:

One problem with <Sc>Prolog</Sc> is that it can try too many things to satisfy a
set of constraints.  The Cut Operator eliminates some of the search
possibilities by committing a search to whatever decisions have already been
made.  It can also prevent the destruction of innocent telescopes.

***  Videos
- [[/videos/prolog-cut][Prolog's Cut Operator]]
- [[https://mediaspace.illinois.edu/media/t/1_14r80n16][Class Session (Spring 2022)]]

