content/lectures/prolog-cut.md
+++
title = "Prolog Cut"
author = ["Mattox Beckman"]
draft = false
type = "book"
+++

One problem with &lt;Sc&gt;Prolog&lt;/Sc&gt; is that it can try too many things to satisfy a
set of constraints.  The Cut Operator eliminates some of the search
possibilities by committing a search to whatever decisions have already been
made.  It can also prevent the destruction of innocent telescopes.


## Videos {#videos}

-   [Prolog's Cut Operator](/videos/prolog-cut)
-   [Class Session (Spring 2022)](https://mediaspace.illinois.edu/media/t/1_14r80n16)
